Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24F08KL200.h
#define _T3CON_TCS_POSITION                      0x00000006
#define _T3CON_TCS_MASK                          0x000000C0
#define _T3CON_TCS_LENGTH                        0x00000002

#define _T3CON_T3CKPS0_POSITION                  0x00000004
#define _T3CON_T3CKPS0_MASK                      0x00000010
#define _T3CON_T3CKPS0_LENGTH                    0x00000001

#define _T3CON_T3CKPS1_POSITION                  0x00000005
#define _T3CON_T3CKPS1_MASK                      0x00000020
#define _T3CON_T3CKPS1_LENGTH                    0x00000001

#define _T3CON_TMR3CS0_POSITION                  0x00000006
#define _T3CON_TMR3CS0_MASK                      0x00000040
#define _T3CON_TMR3CS0_LENGTH                    0x00000001

#define _T3CON_TMR3CS1_POSITION                  0x00000007
#define _T3CON_TMR3CS1_MASK                      0x00000080
#define _T3CON_TMR3CS1_LENGTH                    0x00000001

#define _CCP1CON_CCPM_POSITION                   0x00000000
#define _CCP1CON_CCPM_MASK                       0x0000000F
#define _CCP1CON_CCPM_LENGTH                     0x00000004

#define _CCP1CON_DCB_POSITION                    0x00000004
#define _CCP1CON_DCB_MASK                        0x00000030
#define _CCP1CON_DCB_LENGTH                      0x00000002

#define _CCP1CON_CCPM0_POSITION                  0x00000000
#define _CCP1CON_CCPM0_MASK                      0x00000001
#define _CCP1CON_CCPM0_LENGTH                    0x00000001

#define _CCP1CON_CCPM1_POSITION                  0x00000001
#define _CCP1CON_CCPM1_MASK                      0x00000002
#define _CCP1CON_CCPM1_LENGTH                    0x00000001

#define _CCP1CON_CCPM2_POSITION                  0x00000002
#define _CCP1CON_CCPM2_MASK                      0x00000004
#define _CCP1CON_CCPM2_LENGTH                    0x00000001

#define _CCP1CON_CCPM3_POSITION                  0x00000003
#define _CCP1CON_CCPM3_MASK                      0x00000008
#define _CCP1CON_CCPM3_LENGTH                    0x00000001

#define _CCP1CON_DCB0_POSITION                   0x00000004
#define _CCP1CON_DCB0_MASK                       0x00000010
#define _CCP1CON_DCB0_LENGTH                     0x00000001

#define _CCP1CON_DCB1_POSITION                   0x00000005
#define _CCP1CON_DCB1_MASK                       0x00000020
#define _CCP1CON_DCB1_LENGTH                     0x00000001

#define _CCP1CON_CCP1M_POSITION                  0x00000000
#define _CCP1CON_CCP1M_MASK                      0x0000000F
#define _CCP1CON_CCP1M_LENGTH                    0x00000004

#define _CCP1CON_DC1B_POSITION                   0x00000004
#define _CCP1CON_DC1B_MASK                       0x00000030
#define _CCP1CON_DC1B_LENGTH                     0x00000002

#define _CCP1CON_CCP1M0_POSITION                 0x00000000
#define _CCP1CON_CCP1M0_MASK                     0x00000001
#define _CCP1CON_CCP1M0_LENGTH                   0x00000001

#define _CCP1CON_CCP1M1_POSITION                 0x00000001
#define _CCP1CON_CCP1M1_MASK                     0x00000002
#define _CCP1CON_CCP1M1_LENGTH                   0x00000001

#define _CCP1CON_CCP1M2_POSITION                 0x00000002
#define _CCP1CON_CCP1M2_MASK                     0x00000004
#define _CCP1CON_CCP1M2_LENGTH                   0x00000001

#define _CCP1CON_CCP1M3_POSITION                 0x00000003
#define _CCP1CON_CCP1M3_MASK                     0x00000008
#define _CCP1CON_CCP1M3_LENGTH                   0x00000001

#define _CCP1CON_DC1B0_POSITION                  0x00000004
#define _CCP1CON_DC1B0_MASK                      0x00000010
#define _CCP1CON_DC1B0_LENGTH                    0x00000001

#define _CCP1CON_DC1B1_POSITION                  0x00000005
#define _CCP1CON_DC1B1_MASK                      0x00000020
#define _CCP1CON_DC1B1_LENGTH                    0x00000001

#define _CCP2CON_CCPM_POSITION                   0x00000000
#define _CCP2CON_CCPM_MASK                       0x0000000F
#define _CCP2CON_CCPM_LENGTH                     0x00000004

#define _CCP2CON_DCB_POSITION                    0x00000004
#define _CCP2CON_DCB_MASK                        0x00000030
#define _CCP2CON_DCB_LENGTH                      0x00000002

#define _CCP2CON_CCPM0_POSITION                  0x00000000
#define _CCP2CON_CCPM0_MASK                      0x00000001
#define _CCP2CON_CCPM0_LENGTH                    0x00000001

#define _CCP2CON_CCPM1_POSITION                  0x00000001
#define _CCP2CON_CCPM1_MASK                      0x00000002
#define _CCP2CON_CCPM1_LENGTH                    0x00000001

#define _CCP2CON_CCPM2_POSITION                  0x00000002
#define _CCP2CON_CCPM2_MASK                      0x00000004
#define _CCP2CON_CCPM2_LENGTH                    0x00000001

#define _CCP2CON_CCPM3_POSITION                  0x00000003
#define _CCP2CON_CCPM3_MASK                      0x00000008
#define _CCP2CON_CCPM3_LENGTH                    0x00000001

#define _CCP2CON_DCB0_POSITION                   0x00000004
#define _CCP2CON_DCB0_MASK                       0x00000010
#define _CCP2CON_DCB0_LENGTH                     0x00000001

#define _CCP2CON_DCB1_POSITION                   0x00000005
#define _CCP2CON_DCB1_MASK                       0x00000020
#define _CCP2CON_DCB1_LENGTH                     0x00000001

#define _CCP2CON_CCP2M_POSITION                  0x00000000
#define _CCP2CON_CCP2M_MASK                      0x0000000F
#define _CCP2CON_CCP2M_LENGTH                    0x00000004

#define _CCP2CON_DC2B_POSITION                   0x00000004
#define _CCP2CON_DC2B_MASK                       0x00000030
#define _CCP2CON_DC2B_LENGTH                     0x00000002

#define _CCP2CON_CCP2M0_POSITION                 0x00000000
#define _CCP2CON_CCP2M0_MASK                     0x00000001
#define _CCP2CON_CCP2M0_LENGTH                   0x00000001

#define _CCP2CON_CCP2M1_POSITION                 0x00000001
#define _CCP2CON_CCP2M1_MASK                     0x00000002
#define _CCP2CON_CCP2M1_LENGTH                   0x00000001

#define _CCP2CON_CCP2M2_POSITION                 0x00000002
#define _CCP2CON_CCP2M2_MASK                     0x00000004
#define _CCP2CON_CCP2M2_LENGTH                   0x00000001

#define _CCP2CON_CCP2M3_POSITION                 0x00000003
#define _CCP2CON_CCP2M3_MASK                     0x00000008
#define _CCP2CON_CCP2M3_LENGTH                   0x00000001

